# olympiad_db.py

OLYMPIAD_TESTS = {
    "9": {
        "variant_1": [
            {
                "question": "1. Укажите ряд слов, в каждом из которых есть непроизносимый согласный",
                "options": [
                    "А) древес...ный, блес...нуть",
                    "В) влас...ый, опас...ный",
                    "С) поз...но, извес...ный",
                    "D) ровес...ник, сверс...ник"
                ]
            },
            {
                "question": "2. Укажите ряд слов со служебными частями речи",
                "options": [
                    "А) и, над, однако, чтобы",
                    "В) не, нет, то, свой",
                    "С) что, который, себя",
                    "D) столько, меня, её"
                ]
            },
            {
                "question": "3. Укажите, в каком слове правильно стоит ударение?",
                "options": [
                    "А) дремотА",
                    "В) красивЕе",
                    "С) свЁкла",
                    "D) сливОвый"
                ]
            },
            {
                "question": "4. Мы знаем писателя, … выступал на вечере.",
                "options": [
                    "A) который",
                    "Б) которая",
                    "C) которое",
                    "Д) которые"
                ]
            },
            {
                "question": "5. Мансур купил словарь, … говорил учитель.",
                "options": [
                    "A) о котором",
                    "Б) в котором",
                    "C) на котором",
                    "Д) с которым"
                ]
            }
        ],
        "variant_2": [
            {
                "question": "1. Я хочу учиться в университете, … носит имя Беруни.",
                "options": [
                    "A) которая",
                    "Б) который",
                    "C) которое",
                    "Д) которые"
                ]
            },
            {
                "question": "2. Азиза написала письмо подруге, которая…",
                "options": [
                    "A) я давно не видела",
                    "Б) учится в колледже",
                    "C) я звонила недавно",
                    "Д) знаешь русский язык"
                ]
            },
            {
                "question": "3. Бабушка хорошо знает врача, … была моя сестра.",
                "options": [
                    "A) который",
                    "Б) о котором",
                    "C) перед которым",
                    "Д) у которого"
                ]
            }
        ],
        "variant_3": [
            {
                "question": "1. Отметьте вариант, в котором все согласные звонкие",
                "options": [
                    "А) от дома",
                    "В) к бережку",
                    "С) отдача",
                    "D) сбежались"
                ]
            },
            {
                "question": "2. В каком значении употреблено выделенное слово: Естественные богатства страны должны принадлежать народу",
                "options": [
                    "А) Созданный природой без вмешательства человека.",
                    "В) Созданный по законам природы и с помощью человечества.",
                    "С) Нормальный, обусловленный самим ходом развития",
                    "D) Непринуждённый, натуральный"
                ]
            }
        ],
        "variant_4": [
            {
                "question": "1. Укажите верное продолжение предложения: Потрогав воду, ...",
                "options": [
                    "A) она показалась мне очень холодной.",
                    "B) мне расхотелось купаться.",
                    "C) я передумал купаться.",
                    "D) её температура была слишком низкой."
                ]
            }
        ]
    },
    "10": {
        "variant_1": [
            {
                "question": "1. Что такое лексика?",
                "options": [
                    "А) Словарный состав языка",
                    "В) Все слова, которые используются в речи",
                    "С) Однозначные слова",
                    "Д) А и В"
                ]
            },
            {
                "question": "2. Отметь слово, в котором слышится на конце звонкий согласный звук.",
                "options": [
                    "А) пирог",
                    "В) газ",
                    "С) поиск",
                    "Д) корабль"
                ]
            },
            {
                "question": "3. Найдите строку, где ударение падает на первый слог.",
                "options": [
                    "А) принял, мельком, инсульт",
                    "В) дочиста, легка, лила",
                    "С) цемент, близка, рвала",
                    "Д) понял, заговор, тортов"
                ]
            }
        ],
        "variant_2": [
            {
                "question": "1. Какие пары фразеологизмов являются антонимами?",
                "options": [
                    "1. Очки втирать — вывести на чистую воду",
                    "2. В рот воды набрать — как с гуся вода",
                    "3. Через пень колоду — спустя рукава",
                    "4. Жить на широкую ногу — сводить концы с концами"
                ]
            }
        ],
        "variant_3": [
            {
                "question": "1. В каком предложении на месте пропуска надо поставить тире?",
                "options": [
                    "А) После пяти часов погода стала портиться (...) мы решили вернуться на дачу.",
                    "В) Александр Антонович немедленно приказал Тишке остановиться (...) их лошади устали.",
                    "С) У меня большое счастье (...) жена из России приезжает.",
                    "Д) Изысканная речь графа Лас-Каза пропала даром (...) старый малаец никогда в жизни не слыхал имени Наполеона."
                ]
            }
        ]
    },
    "11": {
        "variant_1": [
            {
                "question": "1. В каком ряду слова расположены не в алфавитном порядке?",
                "options": [
                    "А) здоровый, истина, обучать, шепнуть, чистый",
                    "В) заря, застилать, застойный, зебра, зуб",
                    "С) проезд, разум, светлый, хвалить, цена",
                    "D) абрикос, гордый, утро, щётка, щуплый"
                ]
            },
            {
                "question": "2. В каком ряду все слова образованы бессуффиксным способом?",
                "options": [
                    "А) золотой, разлом, завуч, пригород",
                    "В) подкоп, разрыв, зелень, тишь",
                    "С) перелесок, муть, кость, китобой",
                    "D) электровоз, крик, заячий, кто-то"
                ]
            }
        ],
        "variant_2": [
            {
                "question": "1. Прочитав какое стихотворение, Белинский обнял Некрасова и воскликнул: «Да знайте ли вы, что вы поэт...»?",
                "options": [
                    "А) «Тройка»",
                    "Б) «Огородник»",
                    "В) «В дороге»",
                    "Г) «Музе»"
                ]
            },
            {
                "question": "2. В каком слове три мягких согласных звука?",
                "options": [
                    "А) бильярд",
                    "Б) перелететь",
                    "В) чистильщик",
                    "Г) житель"
                ]
            }
        ],
        "variant_3": [
            {
                "question": "1. Укажите слово с удвоенной согласной в корне.",
                "options": [
                    "А) русский",
                    "Б) матросский",
                    "В) коллекция",
                    "Г) рассказать"
                ]
            }
        ]
    }
}
