# olympiad_db.py

OLYMPIAD_TESTS = {
    "9": {
        "variant_1": [
            # 9-синф 1-вариант саволлари
        ],
        "variant_2": [
            # 9-синф 2-вариант саволлари
        ],
        "variant_3": [
            {
                "question": "1. Отметьте вариант, в котором все согласные звонкие",
                "options": ["А) от дома", "В) к бережку", "С) отдача", "D) сбежались"],
                "correct": "C"
            },
            {
                "question": "2. В каком значении употреблено выделенное слово в предложении Естественные богатства страны должны принадлежать народу",
                "options": [
                    "А) Созданный природой без вмешательства человека.",
                    "В) Созданный по законам природы и с помощью человечества.",
                    "С) Нормальный, обусловленный самим ходом развития",
                    "D) Непринуждённый, натуральный"
                ],
                "correct": "A"
            }
        ],
        "variant_4": [
            {
                "question": "1. В каких словах происходит оглушение согласных?",
                "options": ["А) голубь, трость", "В) моря, плеск", "С) мириться, шторм", "D) молодёжь, подпись"],
                "correct": "A"
            },
            {
                "question": "2. Что означает выражение 'без сучка без задоринки'?",
                "options": [
                    "А) Иметь много проблем и препятствий",
                    "В) Проделать что-то очень быстро",
                    "С) Сделать что-либо без каких-либо затруднений, гладко",
                    "D) Сделать что-то без настроения, без желания"
                ],
                "correct": "C"
            }
        ]
    },
    "10": {
        "variant_1": [
            # 10-синф 1-вариант саволлари
        ],
        "variant_2": [
            # 10-синф 2-вариант саволлари
        ],
        "variant_3": [
            {
                "question": "1. Укажите вариант, в котором все согласные твёрдые.",
                "options": ["А) роща", "В) пчела", "С) уборщица", "D) парашют"],
                "correct": "A"
            },
            {
                "question": "2. Каким способом образовано слово ОТЛЕТ?",
                "options": [
                    "А) приставочный",
                    "В) суффиксальный",
                    "С) приставочно-суффиксальный",
                    "D) бессуффиксный"
                ],
                "correct": "D"
            }
        ]
    },
    "11": {
        "variant_1": [
            # 11-синф 1-вариант саволлари
        ],
        "variant_2": [
            # 11-синф 2-вариант саволлари
        ],
        "variant_3": [
            {
                "question": "1. Каким фонетическим признаком объединены следующие слова: подсечь, мягкий, ложка, обтесать?",
                "options": [
                    "А) Оглушение согласных на конце слова.",
                    "В) Оглушение согласных перед другими согласными.",
                    "С) Озвончение.",
                    "D) Смягчение согласных перед другими согласными."
                ],
                "correct": "B"
            },
            {
                "question": "2. Укажите предложение, в котором есть только качественные прилагательные.",
                "options": [
                    "А) Река вздулась от больных осенних дождей",
                    "В) Солнце ещё не взошло, а охотники за сладкой клюквой спустились в большое болото",
                    "С) В середине лета в маленьком Бабушкином домике поселился квартирант",
                    "D) В Войновской памяти проносились все события его короткой жизни"
                ],
                "correct": "A"
            }
        ]
    }
}